# RebarTrimExtendData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarTrimExtendData Properties
RebarTrimExtendData Class See Also
---
The RebarTrimExtendData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace